In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import string
import datetime

In [48]:
expense = pd.read_csv('expense_txt.csv', 
                      sep='|', 
                      converters = {'Amount': lambda x : float(string.replace(string.replace(x, '$', ''),',',''))}, 
                      parse_dates=['Date'], 
                      date_parser= lambda y : datetime.datetime.strptime(y, '%m/%d/%Y'))

expense[:5]

        Date  Category         Item  Amount Regular ? Remark
0 2015-07-14  Domestic  rubbish bin   255.0         N     友誠
1 2015-07-25  Domestic           厨紙    34.9         Y    NaN
2 2015-07-25      Cook           茄汁    18.9         Y    NaN
3 2015-07-25      Cook           生抽    10.9         Y    NaN
4 2015-07-25  Domestic         即棄餐具    19.8         N    NaN

In [49]:
expense.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 747 entries, 0 to 746
Data columns (total 6 columns):
Date         747 non-null datetime64[ns]
Category     747 non-null object
Item         747 non-null object
Amount       747 non-null float64
Regular ?    747 non-null object
Remark       590 non-null object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 29.2+ KB

In [50]:
expense.describe()

            Amount
count   747.000000
mean    164.567055
std     374.105312
min       2.000000
25%      23.000000
50%      44.000000
75%     119.000000
max    2655.000000

In [51]:
expense[expense.Category == 'Jinny'].head(10)

          Date Category       Item  Amount Regular ?            Remark
9   2015-07-26    Jinny         奶粉     299         Y               NaN
60  2015-08-06    Jinny         奶粉     299         Y               NaN
66  2015-08-07    Jinny         尿片    1300         Y     and 洗奶樽 / 思思樂
67  2015-08-07    Jinny         奶樽     178         N  Doctor Brown x 2
68  2015-08-07    Jinny          鞋      92         N       Hello Kitty
69  2015-08-07    Jinny  Cook book      98         N             Hilda
86  2015-08-10    Jinny         奶樽     190         N      David helped
140 2015-08-19    Jinny        百日宴    1800         N                 訂
148 2015-08-22    Jinny    Clothes     591         Y        Chickeduck
152 2015-08-23    Jinny         奶粉     299         Y               NaN

In [52]:
expense[(expense.Date >= '2015-09-01') & (expense.Date < '2015-10-01')].head(10)

          Date  Category       Item  Amount Regular ?            Remark
192 2015-09-01      Bill     Meifoo  1096.0         Y               NaN
193 2015-09-01      Meal      Lunch    30.0         Y               車仔麵
194 2015-09-01      Meal  Breakfast    12.9         Y  seven eleven 三文治
195 2015-09-01      Misc      Stamp    17.0         N               NaN
196 2015-09-02      Meal  Breakfast    25.0         Y                興濱
197 2015-09-02      Meal      Lunch   100.0         Y          Triple O
198 2015-09-02      Meal      Lunch    48.0         Y               燉奶佬
199 2015-09-02      Misc        疤痕敵   390.0         N               NaN
200 2015-09-02  Domestic        沖涼球    20.0         Y               日本城
201 2015-09-02      Misc   Air pump    25.0         N               NaN

In [57]:
byCatAndReg = expense.groupby(['Category', 'Regular ?'])
byCatAndReg.sum()

                       Amount
Category  Regular ?
Apartment N            220.00
Bill      N            320.00
          Y          38572.50
Clothes   N            256.00
          Y           2030.90
Cook      N           1372.20
          Y          13478.80
DanSan    N             40.10
          Y            100.00
Domestic  N           3310.00
          Y           5724.00
Drive     N            481.80
          Y           3495.50
Jinny     N          11956.10
          Y           8536.29
Leisure   Y            114.00
Meal      N            844.00
          Y          23769.30
Misc      N           4007.30
          Y           1046.90
Transport N            129.50
          Y           3126.40

In [85]:
dates = pd.date_range('20150101', periods=30)

dates

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10', '2015-01-11', '2015-01-12',
               '2015-01-13', '2015-01-14', '2015-01-15', '2015-01-16',
               '2015-01-17', '2015-01-18', '2015-01-19', '2015-01-20',
               '2015-01-21', '2015-01-22', '2015-01-23', '2015-01-24',
               '2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30'],
              dtype='datetime64[ns]', freq='D')

In [86]:
cutResult = pd.cut(expense['Date'], dates)

TypeError: Cannot cast ufunc less input from dtype('<m8[ns]') to dtype('<m8') with casting rule 'same_kind'